TABLES  -*- mode: org; fill-column: 82 -*-
#+CATEGORY: tables
#+STARTUP: content
#+seq_todo: TODO STARTED(s/@) WAITING(w@/@) DELEGATED(l@/@) APPT | DONE(d@/@) DEFERRED(f@/@) CANCELLED(x@/@) IDEA(i/@)
#+TAGS: { SCHOOL(s) BLOG(b) TIL(t) }
#+PROPERTY: Effort_ALL 0 0:10 0:30 1:00 2:00 3:00 4:00 5:00 6:00 7:00
#+COLUMNS: %30ITEM(Task) %CLOCKSUM %15Effort(Effort){:}

** DONE #lang racket/tables racket/base/tables
CLOSED: [2019-06-23 Sun 14:01] SCHEDULED: <2019-06-23 Sun>
- State "DONE"       from "STARTED"    [2019-06-23 Sun 14:01] \\
  Tables now moved to its own multi package that provides 2 collections: tables and
  racket. I even simplified the way #langs are exposed - no need for foo-lang.rkt
  indirection I do in prelude.
:LOGBOOK:
CLOCK: [2019-06-23 Sun 12:53]--[2019-06-23 Sun 14:01] =>  1:08
:END:

IIUC our tables package will be 'multi extending racket/ and racket/base
collections as needed:
- racket/tables.rkt
- racket/base/tables.rkt

** DONE gen:dict interface for tables
CLOSED: [2019-05-30 Thu 15:09]
- State "DONE"       from "STARTED"    [2019-05-30 Thu 15:09] \\
  Implemented gen:dict, which means gen:associative works and therefore get: and
  set: work too.
- State "STARTED"    from "TODO"       [2019-05-30 Thu 15:08]
:LOGBOOK:
CLOCK: [2019-05-30 Thu 15:08]--[2019-05-30 Thu 15:09] =>  0:01
:END:

to serve as "raw" operations - the kind that only works on the main contained and
is oblivious to metatables and inheritance. Think ~rawget~ and ~rawset~ in Lua.

**** DONE ? operator for undefined values
CLOSED: [2019-06-25 Tue 09:56] SCHEDULED: <2019-06-25 Tue>
- State "DONE"       from "STARTED"    [2019-06-25 Tue 09:56] \\
  Had to rename <spec> combinators from ? and ! to opt and req.
:LOGBOOK:
CLOCK: [2019-06-25 Tue 09:24]--[2019-06-25 Tue 09:56] =>  0:32
:END:

? takes 2 args defaulting the secord to #f. If the first arg is undefined return
the 2nd arg, else return the 1 arg unchanged. I hope this would simplify handling
undefined values immensely and bridge their use into broader Racket ecosystem that
typically relies on #f signal.

#+begin_src racket
  (? undefined)
  ;; =>
  #f

  (? undefined v)
  ;; =>
  v

  (? (not undefined))
  ;; =>
  (not undefined)
#+end_src

*** DONE default <get> metamethod semantics
CLOSED: [2019-05-30 Thu 16:14]
- State "DONE"       from "STARTED"    [2019-05-30 Thu 16:14]
- State "STARTED"    from "TODO"       [2019-05-30 Thu 15:28]
:LOGBOOK:
CLOCK: [2019-05-30 Thu 15:28]--[2019-05-30 Thu 16:14] =>  0:46
:END:

Inspired by Lua but instead of ~__index~ indirection a-la Lua we lookup missing
key in the metatable unless :get metamethod is defined, then we call it passing
self. To make sure we don't lose any flexibility that Lua semantics affords we
could also allow setting :<get> to a table, in which case it would perform a
lookup there. I don't think it adds anything beyond what a function could do, but
hey why not.

*** DONE default <insert> metamethod semantics
CLOSED: [2019-05-30 Thu 18:08]
- State "DONE"       from "STARTED"    [2019-05-30 Thu 18:08] \\
  Added tests.
- State "STARTED"    from "TODO"       [2019-05-30 Thu 17:57]
- State "TODO"       from "STARTED"    [2019-05-30 Thu 17:41] \\
  Implemented ~set~. Need to add tests.
- State "STARTED"    from "TODO"       [2019-05-30 Thu 16:15]
:LOGBOOK:
CLOCK: [2019-05-30 Thu 17:57]--[2019-05-30 Thu 18:08] =>  0:11
CLOCK: [2019-05-30 Thu 16:15]--[2019-05-30 Thu 17:41] =>  1:26
:END:

Implementing <insert> metamethod I made an interesting observation re the
semantics of metamethods. Metamethod is only ever looked up on the metatable
proper not its inheritance chain. Effectively:
#+begin_src racket
  ;; Lua equivalent of rawget
  (dict-ref (table-meta t) :<insert>)
#+end_src
that is what Lua does, too, and unless I'm mistaken my first Lua table
implementation does the wrong thing - it looks for metamethod on the entire
metachain. I wonder if such semantics would be interesting. Technically, we could
implement something like it simply by setting <insert> or any other metamethod for
that matter to a procedure that does the deep metachain lookup for <insert>.

*** DONE consider set semantics: undefined removes the entry
- State "DONE"       from "STARTED"    [2019-06-03 Mon 16:08] \\
  This turned out quite pleasant IMO. At least atm it feels better than all of the
  error juggling and checking for undefined. It also made ~rm~ (remove entry)
  procedure trivial.
- State "STARTED"       from "TODO"    [2019-06-03 Mon 15:20]
:LOGBOOK:
CLOCK: [2019-06-03 Mon 15:20]--[2019-06-03 Mon 16:10] =>  0:50
:END:

This may actually proves great. No error would ever be thrown. Semantics are
simple. Constructor becomes trivial: either silently ignore entries with undefined
value or creat an (ht) without any check, then iterate and remove any entries with
undefined on premise that there would typically be very few of them. I really like
this.

*** DONE set: guard against undefined
CLOSED: [2019-06-03 Mon 15:19]
- State "DONE"       from "STARTED"    [2019-06-03 Mon 15:19]
:LOGBOOK:
CLOCK: [2019-06-03 Mon 15:03]--[2019-06-03 Mon 15:19] =>  0:16
:END:

*** DONE consider <set> metamethod semantics
CLOSED: [2019-06-04 Tue 13:06]
- State "DONE"       from "STARTED"    [2019-06-04 Tue 13:06] \\
  Implemented <set> semantics and removed <insert> completely. Also implemented
  dict-set! to disallow undefined values. This needs some thinking and more tests.
- State "TODO"       from "STARTED"    [2019-06-04 Tue 10:08]
:LOGBOOK:
CLOCK: [2019-06-04 Tue 12:05]--[2019-06-04 Tue 13:06] =>  1:01
CLOCK: [2019-06-04 Tue 09:39]--[2019-06-04 Tue 10:08] =>  0:29
:END:

- State "TODO"       from "IDEA"       [2019-06-04 Tue 09:30] \\
  In light of <spec> implementation that may want to guard values being inserted and
  set I should try <set>. I expect it to subsume <insert>.
Big question is whether we need it at all. <set> and <insert> each can be
implemented in terms of the other, so maybe consider keeping just one.

<set> takes 3 arguments: self (table), key and a new value. Since the
self argument is the table before the change, we may also guard the relationship
between the old value and the new. This also hints that <insert> is redundant and
amounts to (t:<set> k v) where t.k is undefined assuming we manage to completely
disallow undefined as a table value. Do we want to keep both around or just the
<set>?

*** DONE default <proc> metamethod semantics
CLOSED: [2019-06-03 Mon 11:21]
- State "DONE"       from "TODO"       [2019-06-03 Mon 11:21] \\
  Leaving current implementation at least till I've used it enough to judge if
  semantics need to change.
- State "TODO"       from "STARTED"    [2019-05-31 Fri 16:35] \\
  Ran into a subtlety: when table is run as a procedure its first argument will
  always be bound to the table whose prop:procedure is being run! This is Racket's
  doing not ours. However, if tables are to be used as procedures then passing the
  table itself to the user's <proc> procedure only makes sense when the procedure is
  actually supposed to act on the table. In general that's not always the case. It
  is conceivable that we may want to allow certain tables act as normal procedures.
  Should we do anything special to tell the two cases apart or do we simply note
  that <prop> metamethod must always have an extra positional argument that'd be
  bound to the table itself?

  Another possible solution is to have two metamethods <prop> and <tprop> with the
  latter taking precedence when both are present. Semantics:
  - when <prop> table is not passed to the user procedure in keyword-apply,
  - when <tprop> table is included in the args to keyword-apply.

  Something to think about.
- State "STARTED"    from "TODO"       [2019-05-31 Fri 15:13]
- State "TODO"       from "STARTED"    [2019-05-31 Fri 14:16] \\
  Write tests.
- State "STARTED"    from "TODO"       [2019-05-31 Fri 13:02]
:LOGBOOK:
CLOCK: [2019-05-31 Fri 15:19]--[2019-05-31 Fri 16:35] =>  1:16
CLOCK: [2019-05-31 Fri 15:13]--[2019-05-31 Fri 15:17] =>  0:04
CLOCK: [2019-05-31 Fri 13:02]--[2019-05-31 Fri 14:16] =>  1:14
:END:

Current implementation does not provide a default <proc> nor does it look beyond
the metatable - that is <proc> is strictly a metamethod and only ever looked up on
the metatable proper. Providing a default or falling through down the ancestor
chain IMO are problematic. Tables are almost too flexible to offer any reasonable
default e.g. what to do with <tables> and multiple inheritance in general. If we
supply the default someone may attempt to rely on it to always be present for any
table, but then someone might override that.

Luckily we can always implement <proc> that falls through up the mt chain, that
would only effect current metatable, which is good. By tweaking table constructors
e.g. #%table or <setmeta> metamethod we could automate this for any metatables we
derive, at least I think so atm.

This is something I need to try in action and see what works and what tricks I can
employ. Anything I come up with now may prove unreasonable in practice.

*** DONE ~table~ constructor
CLOSED: [2019-06-23 Sun 15:50] SCHEDULED: <2019-06-23 Sun>
- State "DONE"       from "STARTED"    [2019-06-23 Sun 15:50] \\
  We now delegate {...} => (table ...) => (#%table ...)
- State "TODO"       from "STARTED"    [2019-06-23 Sun 15:18]
:LOGBOOK:
CLOCK: [2019-06-23 Sun 15:30]--[2019-06-23 Sun 15:50] =>  0:20
CLOCK: [2019-06-23 Sun 15:13]--[2019-06-23 Sun 15:18] =>  0:05
:END:

for when you don't want to use {} syntax or your need to compute metatable.
#+begin_src racket
  (table (compute <mt>)
         #:trait1 trait1
         #:trait2 trait2
         (:a 1)
         (:b 2))
#+end_src

*** DONE {proc ...} constructor
CLOSED: [2019-06-23 Sun 19:10] SCHEDULED: <2019-06-23 Sun>
- State "DONE"       from "STARTED"    [2019-06-23 Sun 19:10] \\
  Also implemented simple (table ...) constructor
- State "TODO"       from "STARTED"    [2019-06-23 Sun 15:54]
:LOGBOOK:
CLOCK: [2019-06-23 Sun 16:02]--[2019-06-23 Sun 19:10] =>  3:08
CLOCK: [2019-06-23 Sun 15:52]--[2019-06-23 Sun 15:54] =>  0:02
:END:

We already allow {<mt> ...} constructor. Say we stick with only id in the app
position there but also allow it to be a procedure, which we call. So it can be in
that order:
1. table - then use it for metatable,
2. procedure - construct default {...} table and pass it to that procedure.

We don't really achieve much with that, cause we could just as easily call this:
#+begin_src racket
  (proc {slots})
#+end_src

So is there any benefit to this?

*** DONE default #%table constructor semantics
CLOSED: [2019-06-01 Sat 20:04]
- State "DONE"       from "STARTED"    [2019-06-01 Sat 20:04] \\
  Added <setmeta> call to default table constructor.
- State "TODO"       from "STARTED"    [2019-06-01 Sat 16:41] \\
  Have basic costructor. Need to add call to <setmeta> metamethod. Also need to
  implement equality, so I can use it in tests.
- State "TODO"       from "STARTED"    [2019-06-01 Sat 15:57]
:LOGBOOK:
CLOCK: [2019-06-01 Sat 19:48]--[2019-06-01 Sat 20:04] =>  0:16
CLOCK: [2019-06-01 Sat 16:09]--[2019-06-01 Sat 16:41] =>  0:32
CLOCK: [2019-06-01 Sat 15:45]--[2019-06-01 Sat 15:56] =>  0:11
:END:

Default #%table semantics then is this:
1. create a fresh table with any slots passed,
2. set its metatable to <metatable>
3. call (t:<setmeta>) metamethod

Anyone can simply redefine #%table to obtain different semantics that wouldn't
break any other code! So, we haven't lost flexibility yet gained robustness!

*** DONE Guard against undefined values in constructor
CLOSED: [2019-06-03 Mon 13:42]
- State "DONE"       from "STARTED"    [2019-06-03 Mon 13:42] \\
  Ended up exposing a guard as a parameter ~table-entry-guard~ set to a procedure
  that takes key and value and returns #t or #f. #f triggers an argument error. User
  may dynamically supply their own guard or set it to #f, which would be equivalent
  to unsafe (do not check for undefined).
:LOGBOOK:
CLOCK: [2019-06-03 Mon 12:30]--[2019-06-03 Mon 13:42] =>  1:12
:END:

Two cases to cover:
- table constructor,
- ~set~ function must ensure that <set>, <insert>, <setmeta> metamethods don't set
  values to undefined).

Alternative: make setting to undefined equivalent to removing the key entirely.
What my Lua implementation currently does.

Alternative: make it a convention and simply say that its UB if you ever attempt
set a slot to undefined. That doesn't sit well with me. However, we could provide
a setting that lets you turn the check off in constructors but say not in ~set~
once you go into production and made sure no undefine can ever occur in the
constructor. Still pretty dangerous but maybe a reasonable trade-off a-la
unchecked integer ops etc.

*** DONE Allow #:kw args in {} constructors
CLOSED: [2019-06-06 Thu 13:59]
- State "DONE"       from "TODO"       [2019-06-06 Thu 13:59] \\
  Have a sketch that works, important task is to figure reasonable and simple
  semantics. Definitely work to do.
- State "TODO"       from "STARTED"    [2019-06-05 Wed 17:40]
- State "TODO"       from "STARTED"    [2019-06-02 Sun 11:54] \\
  It's actually not obvious how to allow #:kw args under the assumption that users
  may want to extend the set of such args with their own keywords. First we need to
  parse them. Assuming we use [[file:~/Code/racket/racket/doc/syntax/syntax-helpers.html?q=parse-keyword-options#%2528def._%2528%2528lib._syntax%252Fkeyword..rkt%2529._parse-keyword-options%2529%2529][parse-keyword-options]] then to parse user options we
  must both expose keyword-table, so the user may extend it then use that extended
  table to parse. But that's just parsing - obtaining options with the rest being
  table entries. Options presumably carry some semantics with them which probably
  ought to transform the constructor result in some way? This too must be user
  supplied if we allow extensions. So you see, not obvious at all. One possible
  solution is for each keyword to represent a table-instance handler
  (imddleware-style) where the final table instance is simply the result of nesting
  all handlers (->> t h1 h2 h3 ...) => final table. But that means that user
  supplied keyword args may only effect table at runtime.
- State "TODO"       from "STARTED"    [2019-06-01 Sat 20:38] \\
  Moved actual parsing into #%table.
:LOGBOOK:
CLOCK: [2019-06-05 Wed 14:00]--[2019-06-05 Wed 17:40] =>  3:40
CLOCK: [2019-06-02 Sun 11:32]--[2019-06-02 Sun 11:54] =>  0:22
CLOCK: [2019-06-01 Sat 20:16]--[2019-06-01 Sat 20:38] =>  0:22
:END:

To simplify life I think we should treat {} syntax exclusively for table
construction. Since the most typical user extension should only ever deal with
#%table, {} can safely pass through any and all arguments without any extra
checks, that includes any #:kw args. All checks will have to be done in #%table
and reported with correct context.

*** DONE Expand {<metatable>} syntax into #%table
CLOSED: [2019-06-01 Sat 20:15]
- State "DONE"       from "TODO"       [2019-06-01 Sat 20:15] \\
  Moved #:kw args into separate TODO item.
- State "TODO"       from "STARTED"    [2019-06-01 Sat 15:44] \\
  We currently expand into #%table, but assume no #:kw args, so checking only table
  entries. Next we should also cover relevant #:kw args.
:LOGBOOK:
CLOCK: [2019-06-01 Sat 15:13]--[2019-06-01 Sat 15:44] =>  0:31
:END:

Expand into ~#%table~, which we expose and let the user override.

#+begin_src racket
(define t {<metatable> #:kw1 opt1 #:kw2 opt2 (key val) ...})
;; =>
(#%table ...)
#+end_src

*** DONE <spec> metatable
CLOSED: [2019-06-05 Wed 10:07]
- State "DONE"       from "STARTED"    [2019-06-05 Wed 10:07] \\
  Seems to work, but uncovered some issues with #%. and t:check is somehow broken,
  so need to debug. Error reporting is basic atm and may need some heavy leaning on
  contract facilities.
- State "TODO"       from "STARTED"    [2019-06-04 Tue 18:06] \\
  Made progress but looks like #%. is buggy - or? fails me again.
- State "TODO"       from "STARTED"    [2019-06-02 Sun 10:52] \\
  Sketched how spec might work
:LOGBOOK:
CLOCK: [2019-06-05 Wed 09:50]--[2019-06-05 Wed 10:07] =>  0:17
CLOCK: [2019-06-04 Tue 16:23]--[2019-06-04 Tue 18:36] =>  2:13
CLOCK: [2019-06-02 Sun 08:35]--[2019-06-02 Sun 10:52] =>  2:17
:END:
**** DONE required / optional combinators for <spec> predicates
CLOSED: [2019-06-07 Fri 11:07]
- State "DONE"       from "STARTED"    [2019-06-07 Fri 11:07]
:LOGBOOK:
CLOCK: [2019-06-07 Fri 10:11]--[2019-06-07 Fri 11:07] =>  0:56
:END:

By default we assume every slot is possible, but not required, an alternative
could be defined by disjunction of undefined (signaling allowed absense) with
predicate (that must be satisfied when slot is present). Contract or predicate by
itself then signals a required slot. This is certainly more verbose, though.

Possible implementation:
#+begin_src racket
  (define (required . contract) (apply and/c (compose not undefined?) contract))
  (define ! required)

  (define (optional . contract) (apply or/c undefined? contract))
  (define ? optional)

  ;; now we should be able to use these in <spec>

  (required (or/c string? number?))
  ;; or
  (! (or/c string? number?))
  ;; =>
  (and/c (compose not undefined?) (or/c string? number?))

  (optional (or/c string? number?))
  ;; or
  (? (or/c string? number?))
  ;; =>
  (or/c undefined? (or/c string? number?))

  ;; example
  (define <mt> {<foo> #:check {<spec> (:optional (? (or/c string? symbol?)))
                                      (:required (! number?))}})
#+end_src

*** DONE consider ditching . syntax in tables
CLOSED: [2019-06-24 Mon 12:07] SCHEDULED: <2019-06-24 Mon>
- State "DONE"       from "STARTED"    [2019-06-24 Mon 12:07] \\
  Both . and .. separators have now been removed. We only use two : and ::.
:LOGBOOK:
CLOCK: [2019-06-24 Mon 10:02]--[2019-06-24 Mon 12:07] =>  2:05
:END:

beginning to think that :: syntax isn't terribly useful. If we ditch current ::
semantics then we may have more consistent syntax without . and .. that is:
- : behaves like . would behave in current implementation,
- :: behaves like : would behave in current implementation.

so then:
#+begin_src racket
  (define <t> {})
  (define (<t>:foo) (is just a function))
  (define (<t>::bar) (is a method with implicit self))
  ;; calls function on t
  (:foo t)
  (t:foo)
  ;; calls method on t, with self = t
  (::foo t)
  (t::foo)
  ;; bonus: key lookup is consistent
  t:foo
  t:bar
  ;; while we still can get a proc if we wanted
  t::bar
#+end_src

*** DONE : and :: for method application
CLOSED: [2019-06-24 Mon 16:24] SCHEDULED: <2019-06-24 Mon>
- State "DONE"       from "STARTED"    [2019-06-24 Mon 16:24] \\
  Ended up simply defining : and :: as kw-procedures. This should allow using them
  even for methods with keyword arguments both with apply and keyword-apply.
:LOGBOOK:
CLOCK: [2019-06-24 Mon 13:13]--[2019-06-24 Mon 16:24] =>  3:11
:END:

but beware of current :tags implementation, appears it rewrites standalone : into
':: - I'll probably want to fix that at least in the app position. Question to ask
yourself - do we allow standalone : and :: that is in expression position -
something we can pass around?

#+begin_src racket
  ;; having this
  (apply : t k t a b rest)
  (apply :: t k a b rest)

  (:meth t a b c)
  (::meth t a b c)
  ;; desugar =>
  (let ((t t)) (t:meth a b c))
  (let ((t t)) (t::meth a b c))

  ;; TODO but would that work in ~> ?
  (: t k a b c)
  (:: t k a b c)
  ;; desugar =>
  (let ((t t) (k k)) (t:k a b c))
  (let ((t t) (k k)) (t::k a b c))
#+end_src

and for completeness impl the same for .. and ::

*** DONE Implement t..k and t::k
CLOSED: [2019-06-07 Fri 13:25]
- State "DONE"       from "STARTED"    [2019-06-07 Fri 13:25] \\
  A bit repetitive but works.
- State "TODO"       from "STARTED"    [2019-06-07 Fri 12:11] \\
  Need tests now.
:LOGBOOK:
CLOCK: [2019-06-07 Fri 12:57]--[2019-06-07 Fri 13:25] =>  0:28
CLOCK: [2019-06-07 Fri 11:17]--[2019-06-07 Fri 12:11] =>  0:54
:END:

*** DONE Expand t.key t:key t..key t::key syntax into #%.
CLOSED: [2019-06-03 Mon 10:32]
- State "DONE"       from "STARTED"    [2019-06-03 Mon 10:32] \\
  There is repetitive work in current implementation with both #%top and #%.
  expansions relying on ~table-sep-key?~. Somehow I fail to see a cleaner
  implementation atm.
- State "TODO"       from "STARTED"    [2019-06-02 Sun 21:33]
- State "TODO"       from "STARTED"    [2019-06-02 Sun 17:23]
- State "TODO"       from "STARTED"    [2019-06-02 Sun 16:46]
:LOGBOOK:
CLOCK: [2019-06-03 Mon 09:11]--[2019-06-03 Mon 10:32] =>  1:21
CLOCK: [2019-06-02 Sun 21:07]--[2019-06-02 Sun 21:33] =>  0:26
CLOCK: [2019-06-02 Sun 17:06]--[2019-06-02 Sun 17:23] =>  0:17
CLOCK: [2019-06-02 Sun 15:06]--[2019-06-02 Sun 16:46] =>  1:40
:END:

*** DONE Add prop:evt to table struct
CLOSED: [2019-06-10 Mon 11:16]
- State "DONE"       from "STARTED"    [2019-06-10 Mon 11:16] \\
  We achieve this by relying on Racket reflection with [[file:~/Code/racket/racket/doc/reference/inspectors.html#%2528def._%2528%2528quote._~23~25kernel%2529._struct-info%2529%2529][struct-info]] to obtain the
  most specific struct type of the metatable passed to the constructor and
  [[file:~/Code/racket/racket/doc/reference/inspectors.html#%2528def._%2528%2528quote._~23~25kernel%2529._struct-type-make-constructor%2529%2529][struct-type-make-constructor]] to actually construct an instance of the extended
  table struct type. This is cute and even preserves the struct type as you start to
  derive new metatables. It does requere however that the new table struct is
  #:transparent and doesn't add any new fields.
:LOGBOOK:
CLOCK: [2019-06-10 Mon 09:33]--[2019-06-10 Mon 11:16] =>  1:43
:END:

